import sys
import math

#-----------------------------------------------------------------------

# Возвращает значение функции вероятности Гаусса со средним значением mu
# и сигма стандартного отклонения при заданном значении x.

def pdf(x, mu=0.0, sigma=1.0):
    x = float(x - mu) / sigma
    return math.exp(-x*x/2.0) / math.sqrt(2.0*math.pi) / sigma

#-----------------------------------------------------------------------

# Возвращает значение кумулятивной функции распределения Гаусса
# со средним значением mu и сигмой стандартного отклонения при заданном значении z.

def cdf(z, mu=0.0, sigma=1.0):
    z = float(z - mu) / sigma
    if z < -8.0: return 0.0
    if z > +8.0: return 1.0
    total = 0.0
    term = z
    i = 3
    while total != total + term:
        total += term
        term *= z * z / i
        i += 2
    return 0.5 + total * pdf(z)

#-----------------------------------------------------------------------

# Принимайте числа с плавающей точкой z, mu и sigma в качестве аргументов командной строки. Используйте их
# для проверки функций phi() и Phi(). Написать
# результаты для стандартного вывода.

def main():
    z = float(sys.argv[1])
    mu = float(sys.argv[2])
    sigma = float(sys.argv[3])

    print(cdf(z, mu, sigma))

if __name__ == '__main__':
    main()

#-----------------------------------------------------------------------

# python gaussian.py 820 1019 209
# 0.17050966869132106
