#2.2.1
import sys
import math
import stdio
#-----------------------------------------------------------------------
#Гиперболический синус.
def sh(x):
    return (math.exp(x) - math.exp(-x)) / 2
#-----------------------------------------------------------------------
#Гиперболический косинус.
def ch(x):
    return (math.exp(x) + math.exp(-x)) / 2
#-----------------------------------------------------------------------
#Гиперболический тангенс.
def th(x):
    return(sh(x)/ch(x))
#-----------------------------------------------------------------------
#Гиперболический котангенс.
def cth(x):
    return(ch(x)/sh(x)) 
#-----------------------------------------------------------------------
#Гиперболический секанс.
def sch(x):
    return(1/ch(x))
#-----------------------------------------------------------------------
#Гиперболический косеканс.
def csch(x):
    return(1/cth(x))
#-----------------------------------------------------------------------        
def main():
    x = float(sys.argv[1])
    stdio.writeln(sh(x))
    stdio.writeln(ch(x))
    stdio.writeln(th(x))
    stdio.writeln(cth(x))
    stdio.writeln(sch(x))
    stdio.writeln(csch(x))

if __name__ == '__main__':
    main()
#-----------------------------------------------------------------------

